{"url":{"0":"https:\/\/www.youtube.com\/watch?v=2CRY5BYf-js","1":"https:\/\/www.youtube.com\/watch?v=8-tyWaOFBPU","2":"https:\/\/www.youtube.com\/watch?v=h9pB1RaTa2U","3":"https:\/\/www.youtube.com\/watch?v=ngBPXUaScCw","4":"https:\/\/www.youtube.com\/watch?v=g9o4_ua2Gv0","5":"https:\/\/www.youtube.com\/watch?v=82fPl5l0vXY","6":"https:\/\/www.youtube.com\/watch?v=7uLzGRlXXDw","7":"https:\/\/www.youtube.com\/watch?v=pZakG-kIt_o","8":"https:\/\/www.youtube.com\/watch?v=C0KW4MvNbIQ","9":"https:\/\/www.youtube.com\/watch?v=ITyGQpyMV_w"},"title":{"0":"Last Day To Avail 30% off On All Courses @iNeuron Intelligence","1":"How To Get 1cr Data Scientist Package?","2":"FAANG DSA Series-Discussing Sorting Algorithms-Selection, Bubble and Insertion Sort- Ft Priya Bhatia","3":"End To End Data Science Industry Ready Projects Course Announcement- Be Industry Ready⭐⭐⭐⭐","4":"Huge Announcement-Access 250+ Recorded And Live Tech Courses For Lifetime-Limited Offer","5":"Hyperparameter Tuning Using Machine Learning Pipelines","6":"Use This Way Of Training Machine Learning Models For Efficiency","7":"Why Statistics Is Super Important For Data Science? Must Watch","8":"Just Watch!!","9":"Quick CheatSheet To Prepare For Statistics For Data Analyst And Data Scientist"},"likes":{"0":"59","1":"1.1K","2":"93","3":"331","4":"160","5":"196","6":"1.1K","7":"328","8":"572","9":"1K"},"number_of_comments":{"0":"34","1":"238","2":"10","3":"102","4":"53","5":"17","6":"57","7":"32","8":"55","9":"49"},"thumbnail":{"0":"http:\/\/img.youtube.com\/vi\/2CRY5BYf-js\/maxresdefault.jpg","1":"http:\/\/img.youtube.com\/vi\/8-tyWaOFBPU\/maxresdefault.jpg","2":"http:\/\/img.youtube.com\/vi\/h9pB1RaTa2U\/maxresdefault.jpg","3":"http:\/\/img.youtube.com\/vi\/ngBPXUaScCw\/maxresdefault.jpg","4":"http:\/\/img.youtube.com\/vi\/g9o4_ua2Gv0\/maxresdefault.jpg","5":"http:\/\/img.youtube.com\/vi\/82fPl5l0vXY\/maxresdefault.jpg","6":"http:\/\/img.youtube.com\/vi\/7uLzGRlXXDw\/maxresdefault.jpg","7":"http:\/\/img.youtube.com\/vi\/pZakG-kIt_o\/maxresdefault.jpg","8":"http:\/\/img.youtube.com\/vi\/C0KW4MvNbIQ\/maxresdefault.jpg","9":"http:\/\/img.youtube.com\/vi\/ITyGQpyMV_w\/maxresdefault.jpg"},"comments":{"0":[{"name":"","comment":"Today is the last day for the offering of 30% off on all the courses  @iNeuron Intelligence  . Use Krish30 as the coupon code. Happy Learning!!\n\nCheck out all the courses link below. This offer is valid till 11th September\n\nData Science Industry Ready Projects :https:\/\/bit.ly\/3qmKGAe\nRead more"},{"name":"aditya tapi","comment":"Hi Krish, important query! I'm from bca +MBA background, having experience  3+years of experience in sales and marketing. I wanna switch to data domain (analysis and science). Which course is best for me in I neuron "},{"name":"satabdi sarangi","comment":"Sir can we get job refferal if we take interview preparstion"},{"name":"MD ASHRAF MOIN","comment":"Duration of the course & when we become ready to apply for job ?"},{"name":"Deep s","comment":"Will these courses be available in tech neuron??"},{"name":"Shashi Kanth","comment":"How the industry ready projects different from the ones already available in tech neuron? Do you teach anything additionally compared to the existing ones?"},{"name":"Arise Awake","comment":"Thank you sir"},{"name":"Shashi Kanth","comment":"Hello Krish, Will the industry ready projects helpful in adding in resume or do you give any suggestions for the projects."},{"name":"srinidhi karjol","comment":"Hello, could you please add an NLP project too? For data science industry ready projects."},{"name":"SAEED SHAIKH","comment":"Hello sir, \nI want to enroll FSDS 2.O but i have a doubt as you say for november batch deep learning is going on. But it's 4 th module in FSDS.. So how much time it take to complete at 40%   of the Modules."},{"name":"education 4all","comment":"Hi Krish.. if these courses will be available on Tech Neuron?"},{"name":"alex pandian","comment":"Hi krish can u give both Data science interview and data science industry grade project both combined at a  discount price?"},{"name":"Gursimran Singh","comment":"data science industrial projects are covered in fsds batch or not?"},{"name":"Mukul Singh","comment":"Sir this course is required for fsds student..I want to your suggestion...you launch the one new course end to end data science industry project.. there total 5 project in complete in 5-6 month .. this course is benefit for me... yeah fsds course is too much... Take a subscription or not.. I think both course will be start same time and when our course is end then project will be covered this  is + point....  second thing is take heavy load  for cover the both course.. this -ve point... what is your opinion???"},{"name":"Ankita Deshpande","comment":"Hello krish sir i want to join this course but after 20th september is it possible to join late into the course"},{"name":"Rajesh Srirangam","comment":"Sir iam believing in you     are you going to lecture in full stack data science live then I will join iam believing in you sir please reply as fast as possible to join today sir️️️ \n\nWhat are the lecture you going this course please do video iam only wanted to see your video sir"},{"name":"Pratish Dewangan","comment":"Please available it for free"},{"name":"CricIn","comment":"Hey Krishna Just want to tell  all the course content is good.But what I feel is there is no timeline allocation for each.Suppose if I am taking the course and am looking more into Data Visualization but if you go to ML initially it will be difficult"},{"name":"Pratish Dewangan","comment":"That's too expensive"},{"name":"davo dl","comment":"Only for fans over 18 year️ Alles sehr schön. Aber zuerst zusammen die Nummern 10 und 1. Eine gedangsiemm.ONLINE Brünette und eine andere Blondine. Es wäre unfair, wennj ich 4 wählen würde"},{"name":"Lori Zhuka","comment":"Hello Sir,\nI made the payment to your Paypal email id. Can you please give me access to the dashboard ?"}],"1":[{"name":"","comment":"This is just an experimentation video.. Let me know whether u want packages videos "},{"name":"DataWithRaja DWR","comment":"pls continue the Data Structures & Algorithm playlist, i hope stacks, queues are covered, waiting for list and linked List videos"},{"name":"Sreekanth Settur","comment":"I was expecting this. Anyways, keeping aside from getting the job, I really love the way we solve problems using various statistical and ML techniques. I keep self-motivating and continue my learning. See krish, we need both like the tenali rama :)"},{"name":"Sahil Raheja","comment":"Nice one Krish \nI suggest based on your network if you can create a video or some content on the current market trend of salaries based on experience, location and type of company. It will help everyone to understand the market scenario and therein negotiate with HR's accordingly."},{"name":"Jayaram Talabattula","comment":"Sir your technical videos are also very helpful. And especially the motivational videos. I connect with your content regularly, and have gained immense knowledge."},{"name":"pankaj sharma","comment":"Yes i just clicked to watch about the guidance for 1 cr package dude but it's ok you said some really truthful things this days i am leaning data analytics i am from Gurgaon Haryana my professional background is financial markets and would love to meet you Krish "},{"name":"Balaji M P","comment":"Krish sir delivering a great message in style as always "},{"name":"Venkat Naveen","comment":"Hi Krish. I'm a data engineer with 1 year experience in Sql and ETL development using Talend Open Studio. What is the skillset you would suggest me to get to know?"},{"name":"Vaibhav yadav","comment":"Sir, people are really interested in technical content also e.g Love Babbar 2.3 lac + hr. View time on dsa course \nThe problem is we are stuck in dsa and easy projects for internship placement "},{"name":"Old soul🌙 11:11","comment":"LOL..Keep doing what u r doing. We need technical knowledge more. Thank u for serving community this way. It inspires so many people like us"},{"name":"Abhishek Mathur","comment":"You said it correctly sir , skills will bring the opportunity by itself so yeah \nI would like to watch technical or new skills content because you explain those stuffs very well"},{"name":"Bhupander Karhana","comment":"Great content sir, dont care much about package, learned many skills from you."},{"name":"Raghavendra Narayana","comment":"thank you sir, for giving a good info to be focused on skills"},{"name":"M Karthik","comment":"Sir u are the best one who's videos i love to watch till end... I love all your videos.. I'm also waiting for your DSA playlist future videos...."},{"name":"Sathwik Sathish","comment":"Hey Krish! I really am really looking forward to learn computer Vision from you! Hence it's a request from my side to you to upload content on Computer Vision! \nThank you"},{"name":"Swati Khedekar","comment":"It's okay for thumbnail.. Sir.. But whenever I see your video..I feel worth it and it's all truth and fact ..focus on skills rather than packages. "},{"name":"Shashi Shekhar","comment":"Can you please start a playlist on Graph neural network. In which some  topic like node Classification,  Graph classification,  edge prediction,  etc..."},{"name":"Madan Kumar","comment":"Awesome, we need these kinds of videos more"},{"name":"Archana Jha","comment":"We want technical content videos Krish happy to learn with you please share all the knowledge you have"},{"name":"Diwakar Arora","comment":"Thank you so much. In a place where I really needed to hear this."},{"name":"solvinny","comment":"Well said. Your technical videos are worth of crores. :) Keep coming those"},{"name":"Zaafir C","comment":"Haha! I was surprised that krish naik would post such a video!\nI've been watching your videos for long and I know how much you put emphasis on skills and not worrying about package.\nI'm happy that it's only an experimentation video."},{"name":"Abcd Abcd","comment":"We want 1cr package guidance video also, we will get to know where we stand in terms of skills to get there.."},{"name":"jide aina","comment":"I want technical videos. the package will definitely \"come\" as you rightly said"},{"name":"The Lucky short🤑","comment":"Really sharp sir thank you for great motivation when I would get money then I will join your channel"},{"name":"Bharath201 uceou","comment":"technical content always ️️️"},{"name":"Mr.Anderson","comment":"Yes we need packages video across industry both in india and abroad\nBlend more technical content though"},{"name":"pamula goutham","comment":"Hi sir,\nMay I know one thing, for learning data science is their age limit?"},{"name":"Pravin Shende","comment":"I am still following this approch .. Thank bc of you i got cosolidation in my target!"},{"name":"Kunal Kotian","comment":"You're Technical Videos are too good Sir"},{"name":"Uttam patel","comment":"We want to both type of videos because technical video improve our knowledge and skills and other types of videos increase our energy power to learn technical skills and keep motivating.\nThank you sir ..."},{"name":"Algocoholic","comment":"Krish... Please keep uploading technical content.  Love you "},{"name":"Sandip Roy","comment":"brother we want very advanced  technical videos  love from Kolkata"},{"name":"Ayush Bhardwaj 111","comment":"This typ of vdos givves  lots motivation  for studying "},{"name":"Samarendra Pradhan","comment":"Very true words sir,to concentrate more on skill development and sharpening"},{"name":"Geeta Tripathi","comment":"You are one of the best You Tube Instructor in Data Science. I don't think we should run after packages. Let packages run after us"},{"name":"ishant somal","comment":"Hi sir please continue with data structures palylist very much needed"},{"name":"Indrajit Pal","comment":"I knew this was a troll video the moment I read the title  - but clicked anyways.\nNeatly done Krish "},{"name":"Jaguar Jag","comment":"Sir we need more technical content and application of those"},{"name":"Rakesh soni","comment":"Great experiment, how much experience is needed to become good to great data scientist, thanks"},{"name":"Haritha Vissapragada","comment":"Pls help us in mastering the datastructures and competitive programing with ur videos"},{"name":"Chandranshu Yadav","comment":"Video was great..I am a devops engineer want to get into data Scientist role...Thank you for your motivation ...i am still not able to make effort getting the knowledge but your videos motivate me and push me to achieve ...maybe one day I will get 1cr package...but I am 38 I don't hope much..."},{"name":"redmash beats","comment":"Come on krish, just drop those videos with your 1cr package friends, I'm ready to watch them like a web series."},{"name":"pratik jadhav","comment":"Sir please make videos on remote jobs from USA,UK as there are many platforms but then if any new skills are required."},{"name":"Insane Harsh","comment":"We want some podcast videos of your friends, having 1Cr. Packages"},{"name":"Sh Ja","comment":"Interested in a video which shares the breakdown of skillsets required to become a data scientist. And then if possible the free and paid sources to learn those skillset and some project ideas for resume. How to grow our network to garner the attention needed on LinkedIN for example.\nEdit: P.S. if sir has made any videos in the past could someone please link it. Thank you."},{"name":"aslam k","comment":"Sir, i completed my degree in year 2010,\nCan i do data science coures&enter into IT sector?"},{"name":"Adi Singh","comment":"Technical content pls cuz these type of content won't make those PPL stay who keep jumping from one video to another.\nTho interviews and insights of industry professionals are much appreciated sir thank you !"},{"name":"Sujith Vadlamudi","comment":"sir, please upload how to write a resume with experience of 2 years. How come we can apply for jobs when all the companies need people with 6 years,8 years experience"},{"name":"Diwaker Yadav","comment":"lol, how have i been fooled, but yes techincal videos are needed more than the package videos, I'm amazed by the quality content of your channel, more of the technical if possible thanks."},{"name":"Arpit Talmale","comment":"i want technical content videos. not about the money first i want to get knowledge to explore myself in industry "},{"name":"Peddaboina Tribhuvan","comment":"Always Technical content bro"},{"name":"Dicklexic Lemon","comment":"We're definitelly interested in technical videos but once in a while drop vids like these."},{"name":"mani kumar donepudi","comment":"Always content bro, generally we don't see these 1 cr salary video,  just it's just uploaded by u, we are seeing"},{"name":"Luv Official","comment":"Hi krish, what is the average and highest CTC offered to fsds students from ineurons..."},{"name":"Hir Kubadia","comment":"Please make a video on which country is good for data science with a detailed comparison betn India vs USA vs UK and differentiate in terms of quality of study, quality of life, job opportunities, etc…"},{"name":"Subhajit Chatterjee","comment":"Krish can you make some videos on implementation of Active learning and codeBERT"},{"name":"Subham Kumar","comment":"Content videos are like marathon. Package videos will motivate me complete this  marathon xD"},{"name":"Ajith Poojary","comment":"We need Technical Content"},{"name":"Afshan Manikpethe","comment":"Hi krish Hope you are doing well. Good Experiment . I want to learn skill sets looking for some good  Institute in Maharashtra Pune."},{"name":"A s","comment":"Hello Krish, content should be 85% & 15% podcast of working data scientist to gain insight what's going on industry. It is not just about package."},{"name":"saurav srivastava","comment":"Hi Krish sir, My name is saurav srivastav, and I just completed my Udemy Data Science with python course. And I wanted to switch my career to Data Science Field and one more thing, I know coading and know about all the tools and libraries. Still, I lack of underconfidence, and I don't have any mentor support, I want a job as a Jr. Data Science at any tech company I want to learn more real worlds projects at any tech-based company. No matter how much salary they gave me. I want a job. But I'm too scared of interviews because I don't have confidence. And I really don't know how can I built my confidence! I need a mentor, who can prepare me for interviews, and recently I left my job just for a data science job. I can't understand, how can I give my interviews to the interviewers and how can I perform over there.\nRead more"},{"name":"Parikshit Saikia","comment":"Bro cracked the algo , Bro knows victoria's secret"},{"name":"Nutriwaywithrohan","comment":"Please make video of packages also so that we know market value"},{"name":"Sairaghav Bysani","comment":"First time not irritated by a clickbait title. Look forward to interviews with 1Cr guys though "},{"name":"【雷涵】Syed","comment":"Fundamentals are important. but for folks in early career or mid-career, might appreciate content on career guidance and know market salaries, so that they are not underpaid. \n\nOfcourse, not clickbaity, but I think there is a substantial viewership market between \"writing NN using NP\" and \"OMG, see how this tier 3-6 fellow got 40CR package\".\nRead more"},{"name":"Shantanu Singh","comment":"Technical video bro they are very helpful for aspiring data scientist"},{"name":"Mallika Mehta","comment":"still struggling to understand the DS and the skills that is required"},{"name":"Vishwas Kumar Sharma","comment":"While clicking the link, I was thinking the same again and again what you're saying right now\nStill I clicked the link\nYou please teach and upload tech videos"},{"name":"Deepa Krishnamurthi","comment":"Time and money spent on learning and gaining knowledge in a skill is never a waste. You can get 1 crore package but sustaining in industry is very important. I am sure only skills can help to sustain."},{"name":"DEV MAHARAJ","comment":"I liked the Videos !\nLet me share my experience in current IT Industry with 6+ years of Experience.\n\nI also used to run behind such huge packages for a self satisfaction (or maybe for show off) and the reality of working in such high packages is very different , very very different. Higher the package , higher is the expectation from you . \nRead more"},{"name":"Shantanu Saraf","comment":"Technical videos ofcourse sir"},{"name":"Girish Sahu","comment":"This was like intro to KBCDS - Kaun Banega Crorepati Data Scientist "},{"name":"Algocoholic","comment":"Please upload videos on college droppers... How they can enter into data science"},{"name":"rohan bamble","comment":"sir, I thought it was regarding skill set required for 1cr or more...... we  want technical vid"},{"name":"naveen soni","comment":"Hi bro ur video  soo informative \nAnd thanks for making videos \nBro Iam  Bcom ..completed in distance mode … \nPeresnt Iam dooing ! A MBA1 st year  from local college ! (Tier 4)\nRead more"},{"name":"The Lucky short🤑","comment":"Yes sir we need both types of video"},{"name":"🅿🆁🅴🆈🅰🅰🅽","comment":"Sir, I like this experimental video "},{"name":"Aadhavan Mahendiran","comment":"we are interested in technical content video sir"},{"name":"Nikhil Iyer","comment":"Bring the people who are getting 1 cr and ask them step by step how they reached there and skills they learnt"},{"name":"Baswaling Ardale","comment":"I have checked your courses sir but I was late to claim offer.\nPlease extend the offer time we want to buy #request"},{"name":"Jaideep Naroo","comment":"lovely message !"},{"name":"Dnyaneshwar Wadikar","comment":"True words....skill matters !!"},{"name":"vaibhav gaware","comment":"Hi Sir, when will next part of NLP is going to come"},{"name":"Dhanush Raj","comment":"Continue with data science!!!!!!"},{"name":"MOHAMMED AZHARUDDIN","comment":"I want negotiation tactics video, please."},{"name":"Shrey Patel","comment":"@krishNaik yes there should be balance ... like if we have skill sets than we also should know what should be our standards in industry like were we stand and what most we  can get"},{"name":"surya pratap singh rathor","comment":"Sir, what a hypothesis!!! "},{"name":"Revanth Bhuvanagiri","comment":"Thanks "},{"name":"Chandrakant Gaur","comment":"With every youtuber uploading clickbait title videos, I was wondering if Krish is falling for same - Thankfully, it's a joke video."},{"name":"Hemanth Kumar","comment":"Needed technical content bro."},{"name":"pooja Katkar","comment":"We want technical videos."},{"name":"mudassir nedian","comment":"You get us in first half xD"},{"name":"Ashish Samrat","comment":"Need SQL video required for data science"},{"name":"BORRA PREMA KISHORE","comment":"can you share about end to end implementation of Fastai"},{"name":"Rajesh P","comment":"help us to figure out how they grab such a high demanding level more than 1 crore in India is like marvelous"},{"name":"Shubham Raj","comment":"Ye toh Heavy Scam ho gayaa ....\nBut sir honestly saying....\nI started my Data Science Journey after completing my college degree during pandemic time... \nI wasn't having a job that time and was learning from your YouTube channel...\nRead more"},{"name":"Abhijit Mali","comment":"please extend offer date for Tech neuron course I want to really buy it. this is really good course....."},{"name":"Greg Hogg","comment":"You got me to click. Love you Krish <3"},{"name":"aswin padmanabhan","comment":"We are looking for technical videos bro"},{"name":"Bidhan Chandra Roy","comment":"Sir I need a job , need an entry in this field. It is ok if as fresher . As i had previous experience in operations management in mining and distribution management . I have some knowledge on data analytics. Python , NumPy, Pandas , SQL recently learn , may be at beginners or intermediate level. Am I eligible to start ?"},{"name":"Just Go With Jojo","comment":"Haha  Okay Will definitely focus of Skills"},{"name":"Sandhya Rani","comment":"I want to know many real time use cases and challenges when we build models"},{"name":"Nitish Bhattacharjee","comment":"we only want technical videos sir"},{"name":"Danis. py","comment":"I wanna ask questions I am in 12 and should I go for btech or build skill for data scientist please answer ? #krishnaik"},{"name":"Javed Baig","comment":"we want technical content."},{"name":"kapil sharma","comment":"V r interested in technical knowledge krish.\nJust sometime v don't able to join on live classes. But we make sure to attend it later.\nLet's learn let's grow."},{"name":"Soumendra Mohanty","comment":"Scam 2022 kr diya bhaiya.but good to see that you told us the truth .plz make a vdo on how to become kaggle grandmaster….or what kind of work data scientist does in daily life.we r wanting to see the things happening on workplace"},{"name":"abhinay thodupunuri","comment":"Need technical content from you"},{"name":"Sanket Wade","comment":"Hi Krish pls share MLops related resources"},{"name":"Data Science Gyan","comment":"need technical skill-related videos... package to ho jayega"},{"name":"praba","comment":"When will we expect data analytics 2.0 bootcamp  ?"},{"name":"Anurag","comment":"Its not April bruv  technical content is important but this is also good"},{"name":"Pavan Kumar","comment":"Awesome Krish Naik "},{"name":"Manas Padhy","comment":"Honestly, I am tired of seeing package videos. I was in need of this. I really expect good quality content, but the hype around package is so much that you get lost in the world full of opportunities."},{"name":"Aryan Yadav","comment":"sir I don't know from where to start! I am just a fresher 1st year student! can you please reply please please!"},{"name":"Shrikant Jadhav","comment":"Add technical content "},{"name":"Aaron Jude","comment":"Interested sir. Because if we aim at 1cr, we can get few lakhs and learning will also be motivating"},{"name":"gaurav kanvinde","comment":"Awesome advertisement "},{"name":"A2 THE GENIUS","comment":"I got what you want to convey"},{"name":"Kushagra Sharma","comment":"Technical content"},{"name":"Stealth","comment":"No bhaiyaa and didi harmed in this video  nyc one"},{"name":"Altamas Creations","comment":"Krish bhai op "},{"name":"Dashing saiteja","comment":"Cheating but okay, good information"},{"name":"sudhanshu kumar","comment":"Sahi Khel gaye GURU !!!"},{"name":"Saptaparni Das","comment":"post study videos obviously :-)"},{"name":"Chandan Kumar","comment":"Apke  sath prank hua hai camera udhar hai :)\nLots of love sir <3"},{"name":"Chhotu Kumar","comment":"What's your current salary?\nPlease make a video again"},{"name":"Ali Paloda","comment":" sahi khel gye"},{"name":"Shritej Thakur","comment":"RESPECT"},{"name":"GORILLA MEMES","comment":"Technical Content..."},{"name":"Haseeb Mohammed","comment":"we want both"},{"name":"M K","comment":"Hi krish.\nI am 45 years old.i have an employment gap of 10 years in IT ..can I learn data science and grab the opportunities..\nPlease  give me honest reply.."},{"name":"Mohd Nazim","comment":" Sri"},{"name":"shivam faclon","comment":"Both \nbut we want to meet any one who is getting 1 -2 cr packeg who is your friend sir"},{"name":"Syed Mohamed Faizan","comment":"How to upgrade my skills i am non tech ?"},{"name":"kaggler","comment":" Click Bait and who doesn't want 1 Cr. Package"},{"name":"baccho ki kahaniya","comment":"Can i become a data scientists after 1 year of diploma"},{"name":"Teja","comment":"Bro I'm not able to get a job in Data science, I'm trying from last 6 months but not able to get one"},{"name":"HaZe","comment":"I just clicked, because I didn't know wtf a data science package was."},{"name":"feed expedition","comment":"techinical content"},{"name":"Uttam Singh","comment":"Please do upload that too"},{"name":"Maneri Vasanth kumar","comment":"As fresher is it possible sir?????"},{"name":"Altamash Ansari","comment":"1 cr ka roadmap btaye bss"},{"name":"TOE","comment":"I am student studying in engineering college , writing to request a price   discount for one neuron. (Independence day discount)\nAs I know your price is already competitive in the market but keeping in mind , please give independence discount . I am waiting to take course but due to bank issue payment was not done. I humbly request  your kind approval.\nRead more"},{"name":"TY_B_60_Saiprasad","comment":"This kind of algorithm is used by Mr beast"},{"name":"Naveen Vinayak","comment":"Krish Technical knowledge is the most import thing , then package will come automatically"},{"name":"Akshay Kumar Singh","comment":""},{"name":"Machine_Learning-AI-Deep_Learning","comment":"haha you got me there"},{"name":"Zeeshan aziz","comment":"Technical content only"},{"name":"Syed Mohamed Faizan","comment":"Ok Anna "},{"name":"amrut parode","comment":""},{"name":"LOVKUSH","comment":"Right bhai .."},{"name":"varun Bollam","comment":"So true..."},{"name":"FILM PICK","comment":"FROM CODEBASICS CHANNEL THE SIR SAYS FOCUS ON SKILLS NOT ON TOOLS ,TODAY HIGHLY VALUED TOOLS MAYBE OBSOLETE TOMORROW BUT NOT SKILL SETS, YAH EVERYONE WANTS CR PACKAGE BUT MAYBE NEED SOME VIDEO REGARDING THE REALITY BEHIND CR PACKAGE JOBS, ALSO WANT TO KNOW IN DATA SCIENCE CR PACKAGE JOB \n\nbeneficiary  OR NOT?"},{"name":"Ramana Praghee","comment":"First interview call itself is not getting scheduled."},{"name":"Venky Moneky","comment":"No bad I had small doubt what should be learn to get good and high paying jobs iam just a web designer in html and I studying b tech. 2nd year so help to get a high paying job"},{"name":"Netra Neupane","comment":"I am looking for it."},{"name":"StockBull","comment":"nice one krish"},{"name":"Anish Krisna","comment":"This kind of package 1 cr"},{"name":"Yu Jian","comment":"Where is the UMAP Mathematical Intuition? \nNo, I dont want 1cr package.."},{"name":"Tanmay","comment":"1 april to nahi hai na ajj?"},{"name":"Creat0r","comment":"Paisa chahiye paisa"},{"name":"Mriganka Ghosh","comment":"Both the content is necessary..."},{"name":"PANKAJ KUMAR BARMAN","comment":""},{"name":"Siddhant Bhagat","comment":""},{"name":"ShafeeqSiddiqui Siddiqui","comment":""},{"name":"jenne Naresh","comment":"Send me technical videos only"},{"name":"Itnesh kumar","comment":"How funny announcement"},{"name":"siddhant pathak","comment":"Great prank."},{"name":"MOHIT TIWARI","comment":"Want technical content"},{"name":"Harshvardhan Tiwari","comment":"That's a clickbait for our own good. Hehe."},{"name":"Kushalappa BE","comment":"good way to bring views"},{"name":"nitesh raghav","comment":"Technical"},{"name":"Sandipan Sarkar","comment":"finished watching"},{"name":"Vikash Das","comment":"Thug Life by Krish Naik"},{"name":"Naresh Y","comment":"Good Prank.."},{"name":"Take a chill pill","comment":"I know it"},{"name":"Chandu","comment":"Please sir .."},{"name":"Sushant Hirave","comment":"Extend 15aug offer please"},{"name":"Akshay Joshi","comment":"Click Bait "},{"name":"ml with stats","comment":"Content vedios"},{"name":"Mazin Akhtar","comment":""},{"name":"s vijay","comment":"HI, krish i want enrol for Tech Neuron offer ended please increase offer date ,,,,, please i am late to arrange money ."},{"name":"Dnyaneshwar Wadikar","comment":"Increase offer of tech neuron date I want to join."},{"name":"Dicklexic Lemon","comment":"god dammit krish T_T"},{"name":"dpak sharma","comment":"August meh april fool.."},{"name":"Charan Singh Goalue","comment":"Click Bait [ALERT] - with message !!!"},{"name":"DSC56_VATSALYA TRIPATHI","comment":"Click bait"},{"name":"Kartikey Chhipa","comment":"You got me.... 🥹\nI've been working in a health-care startup as a junior datascientist, and having difficulty choosing domain. could you please help with a video on choosing a domain.\nthanks alot."},{"name":"mitali gupta","comment":""}],"2":[{"name":"","comment":"Do subscribe Priya Youtube channel for more DSA videos.\n\nhttps:\/\/www.youtube.com\/c\/PriyaBhatia\nCheck out Priya Bhatia course on DSA for FAANG preparation with Python and JavaScript\nhttps:\/\/ineuron.ai\/course\/DSA-for-FAANG-preparation-with-Python-and-JavaScript"},{"name":"Nikhil","comment":"Thank you so much. Much more clear, concise, and understandable. Keep up the great work!"},{"name":"Value Pilgrim","comment":"Excellent job Mam! Precise, to the point and with examples. Thanks for these excellent, excellent videos."},{"name":"Deepak Pandey","comment":"Krish sir you found a gem . Very nice lecture mam "},{"name":"Satyam","comment":"Please share pdf of notes, it will be helpful in revision."},{"name":"Aaron Jude","comment":"Sir. Can you tell me if this knowledge is important for Data science interview ?"},{"name":"info PC and mobile","comment":"Nice lecture"},{"name":"Aakash IITBombay","comment":"please also make videod on DS too  i.e linklist and nonlinear data structure"},{"name":"Sanniboyina Venkata Kiran","comment":"Thank u so much mam"},{"name":"Anand Kishore","comment":"superb"}],"3":[{"name":"","comment":"Happy Teacher's Day. On the occasion of this auspicious day we at @iNeuron Intelligence are offering 30% off on all the courses. Use Krish30 as the coupon code. Happy Learning!!\n\nCheck out all the courses link below. This offer is valid till 11th September\n\nData Science Industry Ready Projects :https:\/\/bit.ly\/3qmKGAe\nRead more"},{"name":"RAGHU RAM","comment":"Hi Sir.. my request, please make industry specific projects like 5 projects all from banking domain,5 projects from retail,5 projects from Healthcare etc.. that will help candidates from functional background  who are speacialised in single domain.. generalist can opt for this existing course & specialist can choose their domain.."},{"name":"Bibek Rauth","comment":"It's great. But the only concern is when you say the industry-ready project, it's not the same.  Because free data doesn't represent the actual raw data. Many times when we work on a project it takes months to understand and gather the data. And working on 5 or 6 different domain projects, would not give a business understanding of any of the domains. Rather working on a particular domain's 5 6 projects would build the understanding."},{"name":"Syed Saqlain Ahmed","comment":"Sir, please replace two projects with deep learning projects for CV and NLP ."},{"name":"Uday Zope","comment":"One more request Sirji , It is very difficult to follow code walkthrough of projects , So please if possible we are expecting implementation videos of entire projects. Thank you in advance"},{"name":"Tanish","comment":"Nice one, this is what i was looking for and got it. but few suggestions from thecomments box like DL, NLP nd domain wise projrct can be looked into if possible...thank you so much sir. you are doing an amazing socialwork (vidhya seva, which greater thanall) by your DS videos and guidelines. thank you again and wish you all success in your life."},{"name":"Pavan Kumar Akula","comment":"Can we take part in this course as a part of the techneuron subscription?"},{"name":"Gustavo Navarro Lema","comment":"Excellent content of the bootcamp...I have a question: after completing the program, can I apply for jobs outside of Argentina? And is there the self-paced option due to time differences (ARG-INDIA)?"},{"name":"Rahul","comment":"Sir, its a humble request, please provide this live course on tech neuron       "},{"name":"Karan saini","comment":"Sir are these projects will be integrated with FSDS-NOV batch? Or is it different batch?"},{"name":"Yashodhan Mandke","comment":"Wow..this is something everyone waiting for"},{"name":"Adrian dominique Arante","comment":"Hello Krish, I saw many negative feedbacks in different websites regarding ineuron courses. It always mentioned that you didn't meet the quality education that you promised for your students who subscribed from your courses."},{"name":"Ratul Sur","comment":"Do we get all recoreded videos of the live classes...in case if we miss any class that would help a lot"},{"name":"srinidhi karjol","comment":"Hello sir, could you please add an NLP project too ?"},{"name":"Sanjay","comment":"What is the prerequisite for this course? Whether I need to complete data science fullstack course?"},{"name":"Harsh Makwana","comment":"Sir will this be later added to One Neuron?"},{"name":"Tushar Dhuri","comment":"Krish You should either provide a list to start (roadmap kind of ) for enrolling courses in tech neuron .So a student should not be confused to where to start .\nJust a suggestion like the career or skill track for the domain like datacamp or 365 data science.\nAlso , the ineuron upcoming section is kinda flawed .Unable to see new courses in next 60 days.Just a random video come up from respective teacher and can see the course after that .\nRead more"},{"name":"TARINIPRASAD DAS","comment":"Sir I have enrolled for FSDS 2.0 . SHOULD I also purchase this course?"},{"name":"RAGHU RAM","comment":"Sir, when is the next data analytics bootcamp coming?"},{"name":"Prudhvi Raj Jallipeta","comment":"Is pyspark, Scala tools also covered in this program"},{"name":"Lori Zhuka","comment":"Hi Sir,\nI get this message when I try to pay using Paypal account „“Your payment didnt go through due to a temporary issue. Any debited amount will be refunded in 4-5 days.“"},{"name":"valli muthaiyah","comment":"Will this be part of one neuron as well sir?"},{"name":"MR. AA","comment":"Sir please create one course for data analytics course too."},{"name":"Saptarshi Sanyal","comment":"Hi Krish, I am confused. I am a student of FSDS, will there be any extra stuff in this industry ready project course?"},{"name":"Saket srivastava","comment":"Request you to include this in tech neuron"},{"name":"shubham poul","comment":"Is it also included in INeuron Platform"},{"name":"tanakam venkata naresh","comment":"Sir can we get the same course for big data industry"},{"name":"Aleti Krishna","comment":"Request you to add this particular course in Techneuron"},{"name":"Akshay Mutalikdesai","comment":"@Krish Naik: i badly want to take this but this time clashes with my big data bootcamp by Ineuron itself. Do we have a batch on weekdays"},{"name":"Adi Singh","comment":"From which course could we start our data science journey"},{"name":"soumya ranjan","comment":"Sir actually I want to do datascience job guarantee program. That will start from 17th sep. This one will start 11ty sep. So how i will take both the course?"},{"name":"Midhun Dugyala","comment":"Excellent sir..."},{"name":"santosh palve","comment":"In future more projects are added on this platform or this is only 5 project?"},{"name":"Nikhil Raj Deep","comment":"Does this end to end projects will be available in one neuron?"},{"name":"Qwer Qwe","comment":"Is this course available for one neuron students sir?"},{"name":"VeeR kottargi","comment":"Is there any plan for Data engineer projects as well."},{"name":"nandini Gandla","comment":"Sir i completed my post graduation from science background. I don't have a knowledge on maths, stats and any program languages. But i want to becom data scientist in pharma company. How can i go through to get knowledge. Is data science course is same for pharma and other non pharma (engenring)?"},{"name":"Sagar Kunte","comment":"I am working in Automotive Cybersecurity, and my company working in Automotive data science. i want to shift in this. Will this project help me to crack interview?. i have basic idea of Python, Machine learning. Please guide me."},{"name":"Gaurav Bhattacharya","comment":"Hi Krish is this course avaible for Tech neuron also ??"},{"name":"Mitesh Pawanarkar","comment":"What is the difference between tech neuron, i neuron, one neuron?"},{"name":"Madhu Venu","comment":"Will this be part of one neuron?"},{"name":"Yeshwant Kumar","comment":"@krish Naik \nSir, will these be available over the tech neuron platform"},{"name":"Yashodhan Mandke","comment":"Can we have access to it on one neuron"},{"name":"Ashish K","comment":"Any project batches available...?"},{"name":"Vishal Singh","comment":"Sir who will be teaching in this course, you or someone else."},{"name":"raju kumar","comment":"Is we enroll for fsds , does this get included"},{"name":"tabish mehdi","comment":"Hi Krish\nWho will be the mentor for this industry ready projects?"},{"name":"pritam patra","comment":"Does fsds batch contain these contents ??"},{"name":"Prerna Sharma","comment":"Hi Krish I want to enroll for this course.....but while navigating to the page using the given link I am getting this error since yesterday....404 Error..Oops, Looks like this page doesn't exist..."},{"name":"Rishi Raj","comment":"Great"},{"name":"DEBASISH","comment":"Can I get the recorded videos if I miss the class?"},{"name":"Ranajay Das","comment":"Please make it available for techneuron subscribers"},{"name":"Data Solution","comment":"just ca off for a spliff to watch tNice tutorials then I'm back on boi"},{"name":"Ratul Sur","comment":"The link is showing error 404"},{"name":"Mahi Khan","comment":"will it be recorded ? i can't attend in live session due to work"},{"name":"Mintu Medhi","comment":"Will it be available in techneuron?"},{"name":"Bhanu Dobbala","comment":"Will this course be added under one techinueron subscription"},{"name":"Manel ALOUI","comment":"Hi Krish, I wanted to enrol to this program, but I can't create an account in ineuron when I put my phone number from Tunisia +216, it displays an error, please provide a valid phone number and I'm sure that's true with +216 since I'm from Tunisia, please help"},{"name":"K J","comment":"I think it's not part of tech neuron"},{"name":"c.n Bhaskar","comment":"Hi krish , this enrollment page is not being displayed ...getting 404 error"}],"4":[{"name":"","comment":"Visit https:\/\/ineuron.ai\/one-neuron\/Tech-Neuron\nUse Krish20 for additional 20% discount\nJoin my Telegram channel where we can discuss anything related to dara science\n\nhttps:\/\/t.me\/+V0UeLG8ji-F8ThNb"},{"name":"Dipannita Bandyopadhyay","comment":"Thank you Krish and Sudhanshu for the amazing content in Tech Neuron. I am learning DS and ML from scratch using the courses in Tech neuron and really happy with the detailed explanations."},{"name":"Ramesh Chordia","comment":"Krish sir and iNeuron really have our back....I am from a tier 3 city sir and my family worked very hard to provide me good education...I must say if ineuron would have been there back in the day our stuggle would have been way lesser....Krish sir and Sudhanshu sir thank you for giving me and my family a good life I was part of your fsds batch and I have made a successful career transition....jai hind and jai iNeuron"},{"name":"Manpreet Sahu","comment":"Thank you so so so much you have made my day and life with one initiative"},{"name":"Manjunath","comment":"I wish you had tech neuron for family .\nIm one subscription... Planning to take one for my wife as well...\nIf we had tech neuron for couples or family then each member adding by paying some extra amount would be great!"},{"name":"Abhishek Gaurav","comment":"Please add Apriori Eclat algo also in the DS course"},{"name":"Paul Aldrin Enriquez","comment":"Hi Krish, just want to ask, the site shows 314 USD. Is that really the cost for international access? 10000 rupees is just around 126 USD."},{"name":"Vikas Rajpuri","comment":"Great initiative sir"},{"name":"sakshi gupta","comment":"Thank you iNeuron and Krish sir JAI HIND"},{"name":"Sujata Nair","comment":"You and iNeuron are true hero's of education..you guys put such hardwork and make it so affordable helping lakhs of people get a better life really grateful to you"},{"name":"Vishal Lalwani","comment":"Thank you sir"},{"name":"chetan badgujar","comment":"I have joined enterprises java and blockchain both a month before,and both are part of techneoron i can see . Means i  paid almost same that you are offering now , \nAs i alredy enrolled before  i have only access of 2 course ,\nThose who will enroll late will get access of 240 course , \nRead more"},{"name":"Jwala Prakash","comment":" "},{"name":"Chaithanya Ch","comment":"Hi krish wat about for ppl who has availed 2yrs access... How can we get lifetime access.. Since paid a month ago"},{"name":"IPL ke sitare","comment":"When will  ineuron app launch"},{"name":"Jyothiswaroop Thatikonda","comment":"Purchased ️"},{"name":"Victor Henostroza","comment":"Sir i click there in your afiliate link but the price says $314.00?????"},{"name":"Hasnain Subhani","comment":"How it is different from one neuron"},{"name":"Karthik R","comment":"Anyone has any idea about quality of content?"},{"name":"coder bharadwaj","comment":"Do we have full stack javascript developer course  available in the subscription."},{"name":"Sandipan Sarkar","comment":"finished watching"},{"name":"mayank yadav","comment":"Bhai saheb ab kya maar hi daloge humko aaplog....itna kaise de dete hai aap log ?\nTahe dil se shurikya aap ko"},{"name":"amitabhjayaswal","comment":"Yes Krish, what's the cost?"},{"name":"Ezra Schroeder","comment":"Is it only for Indians? How many courses are in English? Can you buy it in the USA? What payment methods do you accept?"},{"name":"SANTAK DAS","comment":"First change the faculties please for data science ,teaching is like bullet train"},{"name":"Kali vara prasad","comment":"Krish, the price has been increased. Is there any discount code. If so please provide Sir."},{"name":"Ak","comment":"Enrolled"},{"name":"Bikram Singh","comment":"Love you from the heart  iNeuron has taken it to heat to educate the country at the most affordable cost so everyone can access quality education"},{"name":"Bikram Singh","comment":"Love you from the heart  iNeuron has taken it to heat to educate the country at the most affordable cost so everyone can access quality education"}],"5":[{"name":"Youtube Premium","comment":"Hello Bhaiya, I have recently done my mbbs education.  And want to take admission in AI in medicine for my Master's. For the same, I need to learn ML and CNNs for medical image analysis using Deep Learning. \n\nI want to start from scratch.  How can I do the same? And any good universities you'd like to suggest to pursue my master's in AI medicine? ( open for foreign universities with scholarships as\nRead more"},{"name":"PANKAJ KUMAR BARMAN","comment":"️️ Thank you sir "},{"name":"Rem Bahadur Gharti","comment":"Nice\/ Thank  you  so  much  sir\/\/"},{"name":"Sakthi Palaniswamy","comment":"Request you to upload a video and explain on tkinter gui scripts needed as a datascient."},{"name":"كيف اتعلم البرمجة","comment":"Python projects for beginners are registered in my account, take advantage of them to develop your skills"},{"name":"Mayank Gupta","comment":"How can i train different models in single pipelining ?"},{"name":"Bhanuprasad Baddam","comment":"Waiting for the video"},{"name":"Ashwin Sushil","comment":"Good video bhai."},{"name":"Zahra Salavati","comment":"great"},{"name":"Prashant Gokul","comment":"I dont see the first part of this video. Why?"},{"name":"venkat anil Adibhatla","comment":"Hey Krish I think something is wrong with your screen,I can see only half of your screen.i am not sure ,if everyone has this issue.please confirm it."}],"6":[{"name":"","comment":"Check our courses\n\nTechNeuron: 200+courses Lifetime Warranty\n\n\n\nCourse url: https:\/\/ineuron.ai\/one-neuron\nRead more"},{"name":"Aayush Ostwal","comment":"Machine Learning is not deterministic, Experiment is the only key!!! Thanks for such content... Kudos!!"},{"name":"yusuf henry","comment":"You are truly a leader!!\nWhat more can we ask for?\nThanks my able professor!!"},{"name":"M Sheraz Khan","comment":"Sir... Please upload detail video about tranform models... VIT, POLYVIT, AST... IF AST, its very well becaus my project to use AST Model for sound classification(.wave files)... Thanks"},{"name":"Folashade Olaitan","comment":"This is amazing! Kudos! Do you mind uploading the notebook please? Thank you"},{"name":"Android User","comment":"Would you mind include the eda, feature engineering, better use any boosting model with cv and everything inside pipeline? Thank you sir."},{"name":"AJAY KUSHWAHA","comment":"Sir one question, instead of trying each algo, can we use automated libraries like pycaret, autoML or other libraries?"},{"name":"Bhuvek kumar","comment":"Thank you sir for this amazing code"},{"name":"data monster","comment":"I just use LightGBM these days. It usually performs best and requires minimal data preprocessing."},{"name":"Rishi Chaitanya","comment":"For so many days, one thing is running in my mind that like how can we decide the range to take for hyperparameter tuning."},{"name":"Sonu Besra","comment":"1000+ likes . Please provide ka whole project implementation"},{"name":"SUMRITI RANJAN PATRA","comment":"You can also use lazy predict library available for python that tests all the available sklearn ML algorithms and gives you the score for each of them."},{"name":"Pratik Pratik","comment":"Tree algo are not sensitive towards un-scaled features, outlier while LR and other parameteric algo are sensitive towards un scaled feature, outlier. In that case this technique is not useful as you are using the same features for all algo"},{"name":"Mamun Hsn","comment":"Today Three people came to our Institute for Data Science program. But any how I convinced them not  to take admission in our institute .\nI highly suggest them to take admission to iNuron. You are doing a great job Sir"},{"name":"ranga abi","comment":"Can you provide the code sir?"},{"name":"Kalu Samuel","comment":"Since trees work generally better than linear algorithms(personal observation) ,  is there any need of using linear algorithms at all when we are finding best models"},{"name":"bhabanisankar dash","comment":"Awesome ....Doing a grt job....hats off"},{"name":"Israel Adegoke","comment":"Pls sir, is the code available?"},{"name":"Ankita Deshpande","comment":"Kirsh sir please teach also about machine learning model deployment in detail"},{"name":"Bradley Marimbire","comment":"Hi sir can we get the code please ?"},{"name":"Rohit Sonawane","comment":"Sir dsa series continue karo please"},{"name":"Mohsin Imam","comment":"Sir please upload this project."},{"name":"Nujhat Fatma","comment":"Sir please share and make a video on this project...."},{"name":"BHARATBHUSHAN DWARKEWASI","comment":"superb..!"},{"name":"Data Science Gyan","comment":"@krish 1000 likes completed ... pls upload end to end"},{"name":"Soubhik Bandhyopadhyay","comment":"Krishna sir bohot din se apko follow kar raha hun plz pura video upload kar dijiyega ipy file ke sath plzz...."},{"name":"prashant yadav","comment":"waiting for this end to end project"},{"name":"🅿🆁🅴🆈🅰🅰🅽","comment":"Sir plz share this end to end project"},{"name":"Ravi Kumar Jyoti","comment":"superb."},{"name":"EMPEROR GAMING","comment":"Good afternoon  sir"},{"name":"Sohan Aryal","comment":"let's make it it to 1000 likes"},{"name":"Nishant Bansal","comment":"Done"},{"name":"Marck82","comment":"Sorry if I am asking something non sense. But instead of doing all of that, why not using AutoML libraries such as Pycaret?"},{"name":"🅿🆁🅴🆈🅰🅰🅽","comment":"1 like remaining  only"},{"name":"Surendhran Cbe","comment":"Sir..I have a doubt that \" in terms of complexity does the project we do in the companies is similar to the project you are doing here ?\" since I pursuing degree so I don't have idea about it..that how could be the complexity of the projects in companies. Can anyone please help me out"},{"name":"Saravanan Karunamurthy","comment":"Hi Krish, 1000 likes completed.. pls provide GitHub link for this code"}],"7":[{"name":"Anurag","comment":"Few use cases of statistics in predictive modeling:\n1. Validating distribution of target variable \n2. Before building models we do have a few hypothesis in our mind or business. After getting the data and target finalization we have to test our hypothesis using various tests.\nRead more"},{"name":"Deepak Holla","comment":"Hi Krish, Your Statistics related videos are a real boon for anyone breaking into the Data field. Kudos to all your efforts!!!"},{"name":"venki vtz","comment":"To find how your model perform, most of the times we use different measurements like f1-score etc... are also statistical measurements only. A small question to all, why we have to divide with n-1 for Variance or SD for sample , but when we calculate for population Var or SD, we divide with n ( n is the no of subjects in the sample or sample size) . Dont escape with avoid Bias. let us make it more statistical"},{"name":"Imtiyaz Shaikh","comment":"More power to Krish bhai\nKeep making such kind of videos related to data science, its very helpful for us. Thank you Krish️️"},{"name":"Mithun Mahato","comment":"Hi Krish,\nI am a Mech Engg graduate, aerodynamics  post graduate from one of the top IITs . I got into EdTech sector in content team 3 years ago in campus placement at IIT. \nPresent CTC 10 LPA.\nRead more"},{"name":"Shubh Pundir","comment":"Please make a playlist for Linear Algebra and Calculus, I recently finished your 7 day live Stat and found it amazing, hope you can do the same for Linear Alg and Calculus"},{"name":"Aditya kumar","comment":"Much needed video at right time \nWow thanks ️"},{"name":"Anuradha Balasubramanian","comment":"Excellent Krish ! You always rock :)"},{"name":"San Malli","comment":"Hello sir i want to learn ai from your channel and i like your teaching way ...but I can't able to find the playlist... please help me here️\nLove From Nepali 🇳🇵🇳🇵 student yrr "},{"name":"dikshant gupta","comment":"Can you please continue NLP Live playlist please?"},{"name":"19-403 Raju","comment":"Krish ..can you specify why exactly hypothesis testing was used ??"},{"name":"shivoham","comment":"I have gone through your statistics video thanks Krish "},{"name":"","comment":"Happy Teacher's Day. On the occasion of this auspicious day we at @iNeuron Intelligence are offering 30% off on all the courses. Use Krish30 as the coupon code. Happy Learning!!\n\nCheck out all the courses link below. This offer is valid till 10th September\n\nFSDS Bootcamp 2.0 With Job Guaranteed: https:\/\/bit.ly\/3qalRaF\nRead more"},{"name":"madhu sudhan","comment":"Sir video header alli spelling mistake --- MUST WATCH pls correct it. Thanks."},{"name":"Matu Chaudhary","comment":"sir linear algebra par 3 video aayega ya nahi wo playlist ka keya hoga"},{"name":"Shubham Singh","comment":"I want to get in data science but i m very weak in dsa . So can i go in data science without dsa"},{"name":"Luv Official","comment":"Hi Krish, you have answered only courses related questions..my que is related to data analytics course with job guarantee... When will you launch  this course.."},{"name":"Pallavi Saxena","comment":"Please share Roadmap to NLP Engineer"},{"name":"Siddhant Kohli","comment":"EDA and ML sir"},{"name":"karthik twarakavi","comment":"Hi Krish, Is SPSS useful tool to learn? For Business\/data analyst"},{"name":"Hitesh Akre","comment":"Hi Krish , you should create a discord server......"},{"name":"Rajaero","comment":"Ride video at right time"},{"name":"Zaid Rehman","comment":"During EDA"},{"name":"Ruudra Patel","comment":"Must Watch*"},{"name":"Mayank Shukla","comment":"Guys the name Data Science and people think they can do it without Maths and Stats ?"},{"name":"Shyam","comment":"Hello"},{"name":"Relaxing","comment":"1 comment"}],"8":[{"name":"Adejumo Ridwan","comment":"6 key points to remember \n2:10 Don't be hard on yourself \n3:26 Give yourself time \n4:00 Don't worry about the outcome \nRead more"},{"name":"MOHAMMED AZHARUDDIN","comment":"I just needed this, i was demotivated that other are transitioning and i am not doing this fast enough. Thank you krish."},{"name":"AHAM GUPTA","comment":"Just one suggestion\nWhen we say or read sentences where negation is used like \"Don't worry much\", our mind omits the negation and our focus is completely on that #worry part whereas when we reframe this particular sentence as \"Just chill and be positive regarding your hard work\", we are more inclined towards the positive side :) \nRead more"},{"name":"Varun Thapa","comment":"Thank You So Much Sir. Your Guidance Definitely Has Helped Me During The Learning Process. I Hope Someday I Get The Chance To Work Under You :)"},{"name":"vivek","comment":"Sure Krish Motivation is needed after certain period of time every one gets demotivated and those who switch career including me .. really its means alot !!"},{"name":"Kiran Reddy","comment":"Hello sir, this has just boosted my energy levels. Yes, we do need this kind of videos from you."},{"name":"Debdeep Chaudhuri","comment":"Krish, Thanks a lot for this video. Sometime when there are so many things to learn & do , this kind of motivational videos really help to be on the right track. Thanks again"},{"name":"KARTHIK A","comment":"Definitely sir, please share these kind of things often for us"},{"name":"siddharth jain","comment":"Hi krish!\nI just wanted to know i want to pursue the python course and I don’t have science background.I am from commerce background.but i have seen few videos of yours and i am getting it little bit.so will i be able to cope-up.Should i continue the course.i am just afraid of getting stuck somewhere."},{"name":"Ajinkya Nagare","comment":"Thanks krish for it, I was also preparing for UPSC and later switch here "},{"name":"Aariz Mobin","comment":"You r the great mentor and motivator... You r making community technological pro .. god bless you... May God give you a lot in return..."},{"name":"ranga abi","comment":"I will loop this video forever Krish ! you are an amazing person !!"},{"name":"TheMIS Blog","comment":"We all need this kind of video every month, thanks krish"},{"name":"Johnny Ram","comment":"You made my day Krish \nRight video at right time.\n\nThank you so much"},{"name":"Explorer","comment":"Can you pls add one word at the end every video \"Keep Learning\" this boost more "},{"name":"Jeeka Krishna","comment":"man i i am really good in maths and even topped in mca entrance exams and was a decent scorer in college. But to learn every concept of python and mastering libraries definitly take time."},{"name":"Neil","comment":"Felt like to keep on listening this booster dose till one hour"},{"name":"Ouedraogo Aboubakari","comment":"Thanks a lot for your useful advices and motivations ."},{"name":"Neeshant N","comment":"Krish...you are a such gem of a person... I joined IITMadras DS course but couldn't continue due work preferences... but your classes and this Krish this motivation was must needed one"},{"name":"Prateek Bajpai","comment":"Thank you sir \n& how to make a career transition to data analyst, what's the road map ,please brief ."},{"name":"Muhammad Tufail","comment":"Krish you are  a very nice teacher, motivator and a good human being"},{"name":"Geeky Programmer","comment":"Yeah please we need more of this kind of videos"},{"name":"Shaik Saad Abdul Tawwab","comment":"Thank You @KrishNaik just the video wanted as per my situation."},{"name":"Aariz Mobin","comment":"Please keep uploading  motivational video time to time as well"},{"name":"Manasa Raju","comment":"Thanks a lot for this Video Sir"},{"name":"Flight JUN510","comment":"please keep up the good work!!!!"},{"name":"kin.1997","comment":"good advice needed to hear something like this"},{"name":"KAVITA TAMBOLI","comment":"I was so motivated that I enrolled for data science course in my nearby Institute...... I have been learning from past 1.5 years, as I have to start from scratch because I didn't know basic of programing....  At this point I only know that they are also not updated about machine learning, deep learning algorithm... And whatever I have learnt is half2 no deep knowledge in any topic python, sql, django..... It's all about money that I have wasted because whatever I have learnt from google and you tube only......"},{"name":"Anas Khan","comment":"Motivated ️"},{"name":"Xicor2oP","comment":"Sir I Am Good In EDA Can I get A Good Job Opportunity For EDA Only?..."},{"name":"Sujith Vadlamudi","comment":"I understand what you are saying sir but after applying to companies they are just sending rejection emails without any interview and some companies ask irrelevant to the field we apply."},{"name":"avinash babu","comment":"Pls continue these kind of videos"},{"name":"Manjunath","comment":"Thanks a lot sir..."},{"name":"Sid Indian","comment":"Thank you ️️️️"},{"name":"Danish Rather","comment":"Hello sir plzz rply... \nI am 2020 MCA pass out  i am still jobless due to some Family tragedy...... \nWill this career gap effect my future career... \nI have started  learning ML\/DS can i do this career transition.. \nRead more"},{"name":"Nandi Bhuvana","comment":"Thankyou amazing video "},{"name":"Saumya Gupta","comment":"Much needed"},{"name":"empty heart","comment":"I realized that I only have the 1st problem and it led up to other 5 problems"},{"name":"KUMAR NITYANAND","comment":"Nice one "},{"name":"Algocoholic","comment":"Meet you soon sir...... Situation matters...... Struggling! Struggling! Struggling!"},{"name":"PRAKHAR AGARWAL","comment":"Krish, when will u complete the nlp playlist ??"},{"name":"Himanshu Joshi","comment":"Needed to listen to this"},{"name":"Preetam rout","comment":"Good evening sir"},{"name":"Debatra Das","comment":"Thanks"},{"name":"kids and toys","comment":"Right video and right time"},{"name":"Vinayakram","comment":""},{"name":"Sandipan Sarkar","comment":"finished watching"},{"name":"KUMAR SARVESH","comment":"Very nice"},{"name":"Patrick Gomez","comment":""},{"name":"Saurav Singh","comment":"He pronounces \"Yiddish\" channel .\nState of the art Machine learning fails to recognise , its uthoob channel."},{"name":"Engineer Anupam","comment":"Can someone guide me to choose JP Morgan or Publcis Sapient? Which is better company to work . I hv 5 year of experience."},{"name":"Mriganka Ghosh","comment":""},{"name":"Sandipan Sarkar","comment":"finished watching"}],"9":[{"name":"","comment":"Hello All,\n\nHappy To announce Full Stack Data Scientist Bootcamp 2.0 With job guaranteed starting from September 17th 2022 from 03:00 PM to 06:00 PM (IST) Saturday - Sunday and 6pm-8pm will be the doubt clearning session. The instructor of the course will be me and Sudhanshu. This course also comes up with previous recorded videos and will be available for lifetime.\nRead more"},{"name":"ankit dutta","comment":"Krish sir, we need such videos..keep up the good work.. last month I cleared an interview and the credit goes to your live statistics playlist..thanks a lot for your help."},{"name":"AkashThing","comment":"Yeah, this is useful. \nCan you share\/upload some video on multivariate analysis of data or multivariate process control?\nThanks for all your content as they are very helpful for quick revision."},{"name":"Suman Goswami","comment":"Yes we need more cheat sheets like this on ML and DL and other topics related to data science.... thank you so much for the video I was actually studying stats from the last week"},{"name":"CODING CLASSES","comment":"Thank you for this type of information, yes sir we need more like this type of cheet sheets, from KIET ️"},{"name":"Muhammad Umair","comment":"Include maximum likelihood  because it is very useful when you learn multiclass cross entropy  (loss function) you will easily understand the concept of loss function."},{"name":"Anuvab Chakraborty","comment":"This type of content is better than package videos"},{"name":"Deepak Holla","comment":"Thanks for this great video!!! Really like the way you cover the Statistics topics... "},{"name":"Ganesh Gunjal","comment":"ur motivation is also important for us sir.... which is at  the last of the video..\nthank u so much sir."},{"name":"Neeshant N","comment":"Thank you Krish...god bless you for  these playlists... just one request... please don't delete them.. "},{"name":"bhabanisankar dash","comment":"great effort...really useful...looking forward to such videos"},{"name":"Sushant Patil","comment":"Make this type of videos on \nExcel , powerbi , python , MySQL \nFor data analyst role...\nIt's very useful, thank you for this statistics video "},{"name":"Satender Singh","comment":"Sir, I have completed everything jn Statistics from your playlists, please tell me which topic should I start next for Data analysis?"},{"name":"Talha Nisar Mughal","comment":"A couple of days ago, I was very disappointed and demotivated for not doing good after learning but your last words motivated me. Love from Pakistan "},{"name":"Manoj Pandey","comment":"Hello krish sir, how are you?\nSir I request you can you make us a  <>Mind Map<> for python, R,  Stat, SQL or NoSQL, ML, DL, NPL & AL pleased "},{"name":"Akky S","comment":"Hello Krish Sir can you make a video on how much maths and statistics is required for data analyst who come from non tech and non maths background"},{"name":"Arslan Ali","comment":"Awesome content. Love it"},{"name":"Sid Indian","comment":"Sir .. you have already done this Vedio on stats - guess 7day playlist ...️️"},{"name":"Rakesh Biswas","comment":"Please provide cheat sheet for python,ML,Deep Learning, Computer Vision and NLP too"},{"name":"Shiv Sharma","comment":"One of the best creators out here.."},{"name":"aswin padmanabhan","comment":"Yes bro we require cheat sheet for other topics"},{"name":"Usman Ayaz","comment":"yes we want these types of clean sheets"},{"name":"Explore with SKP","comment":"Yes , we want these kind cheatsheet videos for ML & DL  as well "},{"name":"Avishek Datta","comment":"Can you upload this entire cheat sheet content in Pdf or Doc or Github? & share the link"},{"name":"KIRAN","comment":"Sir we want it more often."},{"name":"Pankaj Kumar","comment":"Please make a video on Cheatsheet for algorithm."},{"name":"vibha gupta","comment":"@krishNaik This is  very insightful. Thanku very much ."},{"name":"Sri Lakshmi","comment":"Yes we need such videos.need cheatsheet for sql"},{"name":"Radha Najan","comment":"Sir what about data science jobs for fresher after 5year"},{"name":"Krish K","comment":"@Krish Naik What is the difference between ineuron fullstack data science and fullstack data science 2.0 both are one and same. Or. Different? Pls reply"},{"name":"c.n Bhaskar","comment":"Hi krish , request you to continue the DSA and Advanced NLP remaining parts"},{"name":"praba","comment":"When will start data analytics bootcamp 2.0 ?"},{"name":"Dilip Kommanapalli","comment":"thanks for sharing"},{"name":"1967- Sabikun Naher Monisha","comment":"Plz make one for sckit learn"},{"name":"DEEPAK SHARMA","comment":"thank you krish.....for this video"},{"name":"Muhammad Zaki Ahmad","comment":"Happy Birthday Sir️"},{"name":"Mehedi Azad","comment":"thank you"},{"name":"VARUN","comment":"what is the course duration for iNueron Full stack Data science bootcamp?"},{"name":"Algocoholic","comment":"I have gone through the videos..... What to say..... Let's say.... BAWAAL"},{"name":"Data Science Gyan","comment":"Ye bahut zaruri tha"},{"name":"DSN","comment":"Good way....man..."},{"name":"Sandipan Sarkar","comment":"finished watching"},{"name":"Vishvas Kumar","comment":"anyone found cheatsheet , in that link i didnot found it sir , if anyone found plzz help"},{"name":"Zaid Zeee","comment":"Your last words it's really motivating!!!\n\nSir Yesterday night I purchased one course from ineuron but I purchased the wrong one I wanted to shift to the correct one and \nthanks to Nancy from your CRM team who helped me with this\nRead more"}]}}