{"url":{"0":"https:\/\/www.youtube.com\/watch?v=g9o4_ua2Gv0"},"title":{"0":"Huge Announcement-Access 250+ Recorded And Live Tech Courses For Lifetime-Limited Offer"},"likes":{"0":"160"},"number_of_comments":{"0":"53"},"thumbnail":{"0":"http:\/\/img.youtube.com\/vi\/g9o4_ua2Gv0\/maxresdefault.jpg"},"S3_Bucket_URL":{"0":"None"},"comments":{"0":[{"name":"","comment":"Visit https:\/\/ineuron.ai\/one-neuron\/Tech-Neuron\nUse Krish20 for additional 20% discount\nJoin my Telegram channel where we can discuss anything related to dara science\n\nhttps:\/\/t.me\/+V0UeLG8ji-F8ThNb"},{"name":"Dipannita Bandyopadhyay","comment":"Thank you Krish and Sudhanshu for the amazing content in Tech Neuron. I am learning DS and ML from scratch using the courses in Tech neuron and really happy with the detailed explanations."},{"name":"Ramesh Chordia","comment":"Krish sir and iNeuron really have our back....I am from a tier 3 city sir and my family worked very hard to provide me good education...I must say if ineuron would have been there back in the day our stuggle would have been way lesser....Krish sir and Sudhanshu sir thank you for giving me and my family a good life I was part of your fsds batch and I have made a successful career transition....jai hind and jai iNeuron"},{"name":"Manpreet Sahu","comment":"Thank you so so so much you have made my day and life with one initiative"},{"name":"Manjunath","comment":"I wish you had tech neuron for family .\nIm one subscription... Planning to take one for my wife as well...\nIf we had tech neuron for couples or family then each member adding by paying some extra amount would be great!"},{"name":"Abhishek Gaurav","comment":"Please add Apriori Eclat algo also in the DS course"},{"name":"Paul Aldrin Enriquez","comment":"Hi Krish, just want to ask, the site shows 314 USD. Is that really the cost for international access? 10000 rupees is just around 126 USD."},{"name":"Vikas Rajpuri","comment":"Great initiative sir"},{"name":"sakshi gupta","comment":"Thank you iNeuron and Krish sir JAI HIND"},{"name":"Sujata Nair","comment":"You and iNeuron are true hero's of education..you guys put such hardwork and make it so affordable helping lakhs of people get a better life really grateful to you"},{"name":"chetan badgujar","comment":"I have joined enterprises java and blockchain both a month before,and both are part of techneoron i can see . Means i  paid almost same that you are offering now , \nAs i alredy enrolled before  i have only access of 2 course ,\nThose who will enroll late will get access of 240 course , \nRead more"},{"name":"Victor Henostroza","comment":"Sir i click there in your afiliate link but the price says $314.00?????"},{"name":"Vishal Lalwani","comment":"Thank you sir"},{"name":"IPL ke sitare","comment":"When will  ineuron app launch"},{"name":"Chaithanya Ch","comment":"Hi krish wat about for ppl who has availed 2yrs access... How can we get lifetime access.. Since paid a month ago"},{"name":"Jwala Prakash","comment":" "},{"name":"Hasnain Subhani","comment":"How it is different from one neuron"},{"name":"Jyothiswaroop Thatikonda","comment":"Purchased ️"},{"name":"Karthik R","comment":"Anyone has any idea about quality of content?"},{"name":"coder bharadwaj","comment":"Do we have full stack javascript developer course  available in the subscription."},{"name":"Ezra Schroeder","comment":"Is it only for Indians? How many courses are in English? Can you buy it in the USA? What payment methods do you accept?"},{"name":"Sandipan Sarkar","comment":"finished watching"},{"name":"mayank yadav","comment":"Bhai saheb ab kya maar hi daloge humko aaplog....itna kaise de dete hai aap log ?\nTahe dil se shurikya aap ko"},{"name":"amitabhjayaswal","comment":"Yes Krish, what's the cost?"},{"name":"Kali vara prasad","comment":"Krish, the price has been increased. Is there any discount code. If so please provide Sir."},{"name":"SANTAK DAS","comment":"First change the faculties please for data science ,teaching is like bullet train"},{"name":"Ak","comment":"Enrolled"},{"name":"Bikram Singh","comment":"Love you from the heart  iNeuron has taken it to heat to educate the country at the most affordable cost so everyone can access quality education"},{"name":"Bikram Singh","comment":"Love you from the heart  iNeuron has taken it to heat to educate the country at the most affordable cost so everyone can access quality education"}]}}